app/Controllers/Admin.php

    public function dashboard()
    {
    $db = \Config\Database::connect();

    $data = [
        'totalUser' => $db->table('users')
            ->countAll(),

        'totalPemilik' => $db->table('users')
            ->where('role','pemilik')
            ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'pemilik'