app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'pencari@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function attempt()
    {
        $model = new UserModel();

        $user = $model
            ->where('email', $this->request->getPost('email'))
            ->first();

INSERT INTO `users` (`nama`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('haha', 'pencari@gmail.com', '$2y$10$1xK.4spO..ucoZrCrPZ/4.Nun86NHWUa5TUniL3w0Zn6ZEcwrQzH2', 'pencari_kost', '2026-06-23 08:13:13', '2026-06-23 08:13:13')
---
    public function store()
    {
        try {

            $model = new UserModel();

            $model->save([
                'nama'     => $this->request->getPost('nama'),
                'email'    => $this->request->getPost('email'),
                'password' => password_hash(
                    $this->request->getPost('password'),
                    PASSWORD_DEFAULT
                ),
                'role'     => $this->request->getPost('role')
            ]);